#### `success` Terraform Format and Style
#### `success` Terraform Initialization
#### ️`success` Terraform Validation
#### `success` Terraform Plan
#### Please check the service here: http://myservice-test-1485955017.us-east-2.elb.amazonaws.com

<details><summary>Show Plan</summary>

```terraform
[0m[1mmodule.webserver_cluster.aws_vpc.myservice_vpc: Refreshing state... [id=vpc-071a049bdc2aa43b3][0m
[0m[1mmodule.webserver_cluster.aws_db_instance.myservice-db: Refreshing state... [id=terraform-20210325155327045800000001][0m
[0m[1mmodule.webserver_cluster.aws_security_group.https-web-access: Refreshing state... [id=sg-075284d16e5c6fc50][0m
[0m[1mmodule.webserver_cluster.aws_security_group.elb: Refreshing state... [id=sg-0f52957c5f32aadd1][0m
[0m[1mmodule.webserver_cluster.aws_internet_gateway.gw: Refreshing state... [id=igw-066b3a9a4d4283838][0m
[0m[1mmodule.webserver_cluster.aws_subnet.myservice_b: Refreshing state... [id=subnet-028be2579a582a0ac][0m
[0m[1mmodule.webserver_cluster.aws_security_group.http-web-access: Refreshing state... [id=sg-09e13a47b5005ec07][0m
[0m[1mmodule.webserver_cluster.aws_subnet.myservice_c: Refreshing state... [id=subnet-06b7e68450bee03ca][0m
[0m[1mmodule.webserver_cluster.aws_security_group.ssh-access: Refreshing state... [id=sg-0fdce336f45e191f2][0m
[0m[1mmodule.webserver_cluster.aws_security_group.db-access: Refreshing state... [id=sg-09281ccdfe93a8ce3][0m
[0m[1mmodule.webserver_cluster.aws_subnet.myservice_a: Refreshing state... [id=subnet-0cdb8347832c5d00e][0m
[0m[1mmodule.webserver_cluster.aws_launch_configuration.myservice: Refreshing state... [id=myservice-test][0m

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
  [33m~[0m update in-place
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # module.webserver_cluster.aws_autoscaling_group.myservice[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_autoscaling_group" "myservice" {
      [32m+[0m [0m[1m[0marn[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mavailability_zones[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mdefault_cooldown[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mdesired_capacity[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mforce_delete[0m[0m              = false
      [32m+[0m [0m[1m[0mhealth_check_grace_period[0m[0m = 300
      [32m+[0m [0m[1m[0mhealth_check_type[0m[0m         = "ELB"
      [32m+[0m [0m[1m[0mid[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mlaunch_configuration[0m[0m      = "myservice-test"
      [32m+[0m [0m[1m[0mload_balancers[0m[0m            = [
          [32m+[0m [0m"myservice-test",
        ]
      [32m+[0m [0m[1m[0mmax_size[0m[0m                  = 1
      [32m+[0m [0m[1m[0mmetrics_granularity[0m[0m       = "1Minute"
      [32m+[0m [0m[1m[0mmin_size[0m[0m                  = 1
      [32m+[0m [0m[1m[0mname[0m[0m                      = "myservice-test"
      [32m+[0m [0m[1m[0mprotect_from_scale_in[0m[0m     = false
      [32m+[0m [0m[1m[0mservice_linked_role_arn[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mvpc_zone_identifier[0m[0m       = [
          [32m+[0m [0m"subnet-028be2579a582a0ac",
          [32m+[0m [0m"subnet-06b7e68450bee03ca",
          [32m+[0m [0m"subnet-0cdb8347832c5d00e",
        ]
      [32m+[0m [0m[1m[0mwait_for_capacity_timeout[0m[0m = "10m"

      [32m+[0m [0mtag {
          [32m+[0m [0m[1m[0mkey[0m[0m                 = "Name"
          [32m+[0m [0m[1m[0mpropagate_at_launch[0m[0m = true
          [32m+[0m [0m[1m[0mvalue[0m[0m               = "terraform-asg-myservice-test"
        }
    }

[1m  # module.webserver_cluster.aws_elb.myservice[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_elb" "myservice" {
      [32m+[0m [0m[1m[0marn[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mavailability_zones[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mconnection_draining[0m[0m         = false
      [32m+[0m [0m[1m[0mconnection_draining_timeout[0m[0m = 300
      [32m+[0m [0m[1m[0mcross_zone_load_balancing[0m[0m   = true
      [32m+[0m [0m[1m[0mdns_name[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0midle_timeout[0m[0m                = 60
      [32m+[0m [0m[1m[0minstances[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0minternal[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "myservice-test"
      [32m+[0m [0m[1m[0msecurity_groups[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0msource_security_group[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0msource_security_group_id[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0msubnets[0m[0m                     = [
          [32m+[0m [0m"subnet-028be2579a582a0ac",
          [32m+[0m [0m"subnet-06b7e68450bee03ca",
          [32m+[0m [0m"subnet-0cdb8347832c5d00e",
        ]
      [32m+[0m [0m[1m[0mzone_id[0m[0m                     = (known after apply)

      [32m+[0m [0mhealth_check {
          [32m+[0m [0m[1m[0mhealthy_threshold[0m[0m   = 2
          [32m+[0m [0m[1m[0minterval[0m[0m            = 30
          [32m+[0m [0m[1m[0mtarget[0m[0m              = "HTTP:4000/"
          [32m+[0m [0m[1m[0mtimeout[0m[0m             = 10
          [32m+[0m [0m[1m[0munhealthy_threshold[0m[0m = 2
        }

      [32m+[0m [0mlistener {
          [32m+[0m [0m[1m[0minstance_port[0m[0m     = 4000
          [32m+[0m [0m[1m[0minstance_protocol[0m[0m = "http"
          [32m+[0m [0m[1m[0mlb_port[0m[0m           = 80
          [32m+[0m [0m[1m[0mlb_protocol[0m[0m       = "http"
        }
    }

[1m  # module.webserver_cluster.aws_security_group.elb[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_security_group" "elb" {
      [33m~[0m [0m[1m[0marn[0m[0m                    = "arn:aws:ec2:us-east-2:307150142929:security-group/sg-0f52957c5f32aadd1" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m                     = "sg-0f52957c5f32aadd1" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mname[0m[0m                   = "myservice-test" [33m->[0m [0m"myservice-elb-test" [31m# forces replacement[0m[0m
      [32m+[0m [0m[1m[0mname_prefix[0m[0m            = (known after apply)
      [33m~[0m [0m[1m[0mowner_id[0m[0m               = "307150142929" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mtags[0m[0m                   = {} [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mvpc_id[0m[0m                 = "vpc-03aec2dcbd4f8888a" [33m->[0m [0m"vpc-071a049bdc2aa43b3" [31m# forces replacement[0m[0m
        [90m# (4 unchanged attributes hidden)[0m[0m
    }

[1m  # module.webserver_cluster.aws_security_group.http-web-access[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_security_group" "http-web-access" {
      [33m~[0m [0m[1m[0megress[0m[0m                 = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = []
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 80
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "tcp"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 80
            },
        ]
        [1m[0mid[0m[0m                     = "sg-09e13a47b5005ec07"
        [1m[0mname[0m[0m                   = "myservice-http-test"
        [1m[0mtags[0m[0m                   = {}
        [90m# (6 unchanged attributes hidden)[0m[0m
    }

[1m  # module.webserver_cluster.aws_security_group.https-web-access[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_security_group" "https-web-access" {
      [33m~[0m [0m[1m[0megress[0m[0m                 = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = []
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 443
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "tcp"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 443
            },
        ]
        [1m[0mid[0m[0m                     = "sg-075284d16e5c6fc50"
        [1m[0mname[0m[0m                   = "myservice-https-test"
        [1m[0mtags[0m[0m                   = {}
        [90m# (6 unchanged attributes hidden)[0m[0m
    }

[1m  # module.webserver_cluster.aws_security_group.ssh-access[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_security_group" "ssh-access" {
      [33m~[0m [0m[1m[0megress[0m[0m                 = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = []
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 4000
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "tcp"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 80
            },
        ]
        [1m[0mid[0m[0m                     = "sg-0fdce336f45e191f2"
        [1m[0mname[0m[0m                   = "myservice-ssh-test"
        [1m[0mtags[0m[0m                   = {}
        [90m# (6 unchanged attributes hidden)[0m[0m
    }

[0m[1mPlan:[0m 3 to add, 3 to change, 1 to destroy.[0m
[0m
[1mChanges to Outputs:[0m
  [33m~[0m [0m[1m[0mmyservice_lb[0m[0m = "myservice-test-1570457971.us-east-2.elb.amazonaws.com" [33m->[0m [0m(known after apply)[0m

------------------------------------------------------------------------

This plan was saved to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"

Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @behoof4mind, Action: `pull_request`, Workflow: `Create PR Env`*